Model: "model_1"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 IEGM_input (InputLayer)        [(1, 360, 1, 1)]     0           []                               
                                                                                                  
 max_pooling2d (MaxPooling2D)   (1, 72, 1, 1)        0           ['IEGM_input[0][0]']             
                                                                                                  
 stream (Stream)                (1, 36, 1, 3)        21          ['max_pooling2d[0][0]']          
                                                                                                  
 batch_normalization (BatchNorm  (1, 36, 1, 3)       12          ['stream[0][0]']                 
 alization)                                                                                       
                                                                                                  
 activation (Activation)        (1, 36, 1, 3)        0           ['batch_normalization[0][0]']    
                                                                                                  
 stream_1 (Stream)              (1, 18, 1, 3)        18          ['activation[0][0]']             
                                                                                                  
 batch_normalization_1 (BatchNo  (1, 18, 1, 3)       12          ['stream_1[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_1 (Activation)      (1, 18, 1, 3)        0           ['batch_normalization_1[0][0]']  
                                                                                                  
 stream_2 (Stream)              (1, 18, 1, 6)        30          ['activation_1[0][0]']           
                                                                                                  
 batch_normalization_2 (BatchNo  (1, 18, 1, 6)       24          ['stream_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_2 (Activation)      (1, 18, 1, 6)        0           ['batch_normalization_2[0][0]']  
                                                                                                  
 stream_3 (Stream)              (1, 7, 1, 6)         0           ['activation_2[0][0]']           
                                                                                                  
 stream_4 (Stream)              (1, 3, 1, 12)        60          ['stream_3[0][0]']               
                                                                                                  
 batch_normalization_3 (BatchNo  (1, 3, 1, 12)       48          ['stream_4[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_3 (Activation)      (1, 3, 1, 12)        0           ['batch_normalization_3[0][0]']  
                                                                                                  
 stream_5 (Stream)              (1, 1, 1, 24)        120         ['activation_3[0][0]']           
                                                                                                  
 batch_normalization_4 (BatchNo  (1, 1, 1, 24)       96          ['stream_5[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_4 (Activation)      (1, 1, 1, 24)        0           ['batch_normalization_4[0][0]']  
                                                                                                  
 dropout (Dropout)              (1, 1, 1, 24)        0           ['activation_4[0][0]']           
                                                                                                  
 stream_6 (Stream)              (1, 48)              0           ['dropout[0][0]']                
                                                                                                  
 stream/ExternalState (InputLay  [(1, 4, 1, 1)]      0           []                               
 er)                                                                                              
                                                                                                  
 stream_1/ExternalState (InputL  [(1, 3, 1, 3)]      0           []                               
 ayer)                                                                                            
                                                                                                  
 stream_2/ExternalState (InputL  [(1, 3, 1, 3)]      0           []                               
 ayer)                                                                                            
                                                                                                  
 stream_3/ExternalState (InputL  [(1, 3, 1, 6)]      0           []                               
 ayer)                                                                                            
                                                                                                  
 stream_4/ExternalState (InputL  [(1, 2, 1, 6)]      0           []                               
 ayer)                                                                                            
                                                                                                  
 stream_5/ExternalState (InputL  [(1, 1, 1, 12)]     0           []                               
 ayer)                                                                                            
                                                                                                  
 stream_6/ExternalState (InputL  [(1, 2, 1, 24)]     0           []                               
 ayer)                                                                                            
                                                                                                  
 dense (Dense)                  (1, 10)              490         ['stream_6[0][0]']               
                                                                                                  
 tf_op_layer_streaming/stream/c  [(1, 76, 1, 1)]     0           ['stream/ExternalState[0][0]',   
 oncat (TensorFlowOpLayer)                                        'max_pooling2d[0][0]']          
                                                                                                  
 tf_op_layer_streaming/stream_1  [(1, 39, 1, 3)]     0           ['stream_1/ExternalState[0][0]', 
 /concat (TensorFlowOpLayer)                                      'activation[0][0]']             
                                                                                                  
 tf_op_layer_streaming/stream_2  [(1, 21, 1, 3)]     0           ['stream_2/ExternalState[0][0]', 
 /concat (TensorFlowOpLayer)                                      'activation_1[0][0]']           
                                                                                                  
 tf_op_layer_streaming/stream_3  [(1, 21, 1, 6)]     0           ['stream_3/ExternalState[0][0]', 
 /concat (TensorFlowOpLayer)                                      'activation_2[0][0]']           
                                                                                                  
 tf_op_layer_streaming/stream_4  [(1, 9, 1, 6)]      0           ['stream_4/ExternalState[0][0]', 
 /concat (TensorFlowOpLayer)                                      'stream_3[0][0]']               
                                                                                                  
 tf_op_layer_streaming/stream_5  [(1, 4, 1, 12)]     0           ['stream_5/ExternalState[0][0]', 
 /concat (TensorFlowOpLayer)                                      'activation_3[0][0]']           
                                                                                                  
 tf_op_layer_streaming/stream_6  [(1, 1, 1, 24)]     0           ['stream_6/ExternalState[0][0]'] 
 /strided_slice (TensorFlowOpLa                                                                   
 yer)                                                                                             
                                                                                                  
 dense_1 (Dense)                (1, 2)               22          ['dense[0][0]']                  
                                                                                                  
 tf_op_layer_streaming/stream/s  [(1, 4, 1, 1)]      0           ['tf_op_layer_streaming/stream/co
 trided_slice (TensorFlowOpLaye                                  ncat[0][0]']                     
 r)                                                                                               
                                                                                                  
 tf_op_layer_streaming/stream_1  [(1, 3, 1, 3)]      0           ['tf_op_layer_streaming/stream_1/
 /strided_slice (TensorFlowOpLa                                  concat[0][0]']                   
 yer)                                                                                             
                                                                                                  
 tf_op_layer_streaming/stream_2  [(1, 3, 1, 3)]      0           ['tf_op_layer_streaming/stream_2/
 /strided_slice (TensorFlowOpLa                                  concat[0][0]']                   
 yer)                                                                                             
                                                                                                  
 tf_op_layer_streaming/stream_3  [(1, 3, 1, 6)]      0           ['tf_op_layer_streaming/stream_3/
 /strided_slice (TensorFlowOpLa                                  concat[0][0]']                   
 yer)                                                                                             
                                                                                                  
 tf_op_layer_streaming/stream_4  [(1, 2, 1, 6)]      0           ['tf_op_layer_streaming/stream_4/
 /strided_slice (TensorFlowOpLa                                  concat[0][0]']                   
 yer)                                                                                             
                                                                                                  
 tf_op_layer_streaming/stream_5  [(1, 1, 1, 12)]     0           ['tf_op_layer_streaming/stream_5/
 /strided_slice (TensorFlowOpLa                                  concat[0][0]']                   
 yer)                                                                                             
                                                                                                  
 tf_op_layer_streaming/stream_6  [(1, 2, 1, 24)]     0           ['tf_op_layer_streaming/stream_6/
 /concat (TensorFlowOpLayer)                                     strided_slice[0][0]',            
                                                                  'dropout[0][0]']                
                                                                                                  
==================================================================================================
Total params: 953
Trainable params: 857
Non-trainable params: 96
__________________________________________________________________________________________________